In [1]:
a=10
b=20
c=a+b
c

30

In [ ]:
===========================EDA===================================

1) Pandas : Data frame applications

2) Numpy : Numerical python all math applications

3) Matplotlib : used for plotting 

4) Seaborn : used for plot 

5) Plotly : used for plot

6) Bokhe : plot 


============================Machine Learning====================================

7) Sickit-learn : sklearn


============================Deep Learning =====================================

8) Tensorflow : google

9) keras  : google

10) pytorch : facebook 

============================NLP==============================================

11) NLTK : Natural language tool kit

12) Scipy 

==================================BERT======================================

13) Transformers : Hugging face(google)

=================================Google models================================

14)specific google packages 

======================================azure ml===================================

15) azure packages

-==================================genai=========================================\

16) gemini : google

17) chatgpt : openai

=============================lanchain=========================================

18) langchain packages

**Create a dataframe using lists**

$Step-1:$

In [2]:
import pandas as pd
names=["ayush","avinash","akash"]

pd.DataFrame()#whenever u will create it , it will empty no rows and no columns

Empty DataFrame
Columns: []
Index: []

$Step-2 :$

provide the data

In [3]:
names=["ayush","avinash","akash"]

pd.DataFrame(names)

         0
0    ayush
1  avinash
2    akash

In [8]:
names=["ayush","avinash","akash"]
age=[23,13,11]
pd.DataFrame(zip(names,age))

#what is the first positional argumrnt: data
#second positional argumrnt: index

         0   1
0    ayush  23
1  avinash  13
2    akash  11

In [9]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
pd.DataFrame(zip(names,age,gender))

         0   1     2
0    ayush  23  male
1  avinash  13  male
2    akash  11  male

In [10]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
data=zip(names,age)
pd.DataFrame(data,gender)

            0   1
male    ayush  23
male  avinash  13
male    akash  11

$Step 3$

**provide the column name**

In [13]:
names=["ayush","avinash","akash"]
age=[23,13,11]

pd.DataFrame(zip(names,age),columns=['Names','age'])

     Names  age
0    ayush   23
1  avinash   13
2    akash   11

In [14]:
names=["ayush","avinash","akash"]
age=[23,13,11]

pd.DataFrame(zip(names,age),[1,2,3],columns=['Names','age'])

     Names  age
1    ayush   23
2  avinash   13
3    akash   11

In [15]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
pd.DataFrame(zip(names,age,gender),[1,2,3],columns=['Names','age','gender'])

     Names  age gender
1    ayush   23   male
2  avinash   13   male
3    akash   11   male

In [16]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
data=zip(names,age,gender)
row=[1,2,3]
cols=['Names','age','gender']
pd.DataFrame(data,row,columns=cols)

     Names  age gender
1    ayush   23   male
2  avinash   13   male
3    akash   11   male

In [17]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
data=zip(names,age,gender)
row=[1,2,3]
cols=['Names','age','gender']
df=pd.DataFrame(data,row,columns=cols)

In [19]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

**ADD new column**

- if you want to add new column 

- first you need to che3ck the number of rows in already exited data 

- for example in above the dataframe has 3 rows 

- you need to create a new list with 3 rows 

- that list equatte to the dataframe

In [23]:
job=['DS','DE','CS']
df['JOB']=job  # or df['JOB']=['DS','DE','CS']
df

     Names  age gender JOB
1    ayush   23   male  DS
2  avinash   13   male  DE
3    akash   11   male  CS

In [25]:
city=['hyd','bnglr','mumbai']
df['CITY']=city
df

     Names  age gender JOB    CITY
1    ayush   23   male  DS     hyd
2  avinash   13   male  DE   bnglr
3    akash   11   male  CS  mumbai

$step-5$

**update the existed column**

- Create new column and update new column are same

$Step-6$

**Change the index**

In [44]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
data=zip(names,age,gender)

cols=['Names','age','gender']
idx=['A','B','C']
df=pd.DataFrame(data,index=idx,columns=cols)


df

     Names  age gender
A    ayush   23   male
B  avinash   13   male
C    akash   11   male

**Note**

- Number of list= **Number of columns** 
- Number of values = **Number of rows**
- When you create the data all the list will be in the same length

**Step-7**

**Shape**

- Number of rows 

- number of columns

In [28]:
df.shape 
## matrix format
# 4 rows 3 columns

print(" the number of rows are : ",df.shape[0])
print("the number of columns are: ",df.shape[1])

 the number of rows are :  3
the number of columns are:  5

$Step-8$

**How to drop the column**

- In order to drop column we required 3 arguments 

- column name 
    - the column name we need to mention 

- axis 

    - axis=0  **represents rows** 
    - axis=1  **represents columns** 

- inplace

    - we are droping the column means we are modifying the data frame

    - so this modifications we want to save in same variable or different variable 

    - if you want to keep in the same variable the **inplace=True**

In [29]:
df

     Names  age gender JOB    CITY
1    ayush   23   male  DS     hyd
2  avinash   13   male  DE   bnglr
3    akash   11   male  CS  mumbai

In [30]:
df.drop('CITY',axis=1,inplace=True)

In [31]:
df

     Names  age gender JOB
1    ayush   23   male  DS
2  avinash   13   male  DE
3    akash   11   male  CS

In [39]:
df1=df.drop('gender',axis=1)

In [40]:
df1

     Names  age
1    ayush   23
2  avinash   13
3    akash   11

In [ ]:
df1=df.drop('gender',axis=1)

$Step-9$

**Multiple column drop**

In [51]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
data=zip(names,age,gender)

cols=['Names','age','gender']
idx=['A','B','C']
df=pd.DataFrame(data,index=idx,columns=cols)


df

     Names  age gender
A    ayush   23   male
B  avinash   13   male
C    akash   11   male

In [53]:
df.drop(['age','gender'],axis=1,inplace=True)

df

     Names
A    ayush
B  avinash
C    akash

In [58]:
names=["ayush","avinash","akash"]
age=[23,13,11]
gender=["male","male","male"]
data=zip(names,age,gender)
row=['A','B','C']
cols=['Names','age','gender']
df=pd.DataFrame(data,row,columns=cols)

In [59]:
df

     Names  age gender
A    ayush   23   male
B  avinash   13   male
C    akash   11   male

In [60]:
df.drop('1',axis=0,inplace=True)

KeyError: "['1'] not found in axis"

$step-11$

**How 

- Generally dataframes are two types

- CSV (Comma seperated value)

-Excel

In [62]:
#file name=data
#extesion=.csv

df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [67]:
#Extension of excel file 
#.xlsx
df.to_csv('data2.xlsx',index=True)